<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="0" name="mel" type="Parameter" version="opset1">
			<data shape="1,80,3000" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="mel">
					<dim>1</dim>
					<dim>80</dim>
					<dim>3000</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="onnx::Conv_870_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 80, 3" offset="0" size="245760" />
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>80</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="onnx::Conv_870" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>80</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_870">
					<dim>512</dim>
					<dim>80</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="/conv1/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="1" pads_end="1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>3000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>80</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>3000</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Reshape_118_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512, 1" offset="245760" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Reshape_118" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/conv1/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>3000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/conv1/Conv_output_0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>3000</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/Mul_1" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>3000</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Mul_1_output_0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>3000</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="onnx::Conv_872_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 512, 3" offset="246784" size="1572864" />
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="onnx::Conv_872" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_872">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/conv2/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2" dilations="1" pads_begin="1" pads_end="1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>3000</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1500</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Reshape_174_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512, 1" offset="1819648" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Reshape_174" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/conv2/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/conv2/Conv_output_0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1500</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/Mul_3" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1500</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Mul_3_output_0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1500</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_210" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1820672" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1500</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Transpose_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_4602_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1500, 512" offset="1820696" size="1536000" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_4602" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Add_2_output_0,/Cast_output_0,/blocks.0/attn_ln/Cast_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_4609_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="3356696" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_4609" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_4605_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="3357720" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_4605" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_215" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3358744" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/blocks.0/attn_ln/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn_ln/Div_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_4603_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="3358752" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_4603" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/blocks.0/attn_ln/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn_ln/Mul_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_4604_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="3359776" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_4604" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/blocks.0/attn_ln/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn_ln/Add_1_output_0,/blocks.0/attn_ln/Cast_1_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_4259_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 512" offset="3360800" size="524288" />
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_4259" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/blocks.0/attn/query/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/query/MatMul_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/blocks.0/attn/query/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/query/Add_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/blocks.0/attn/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3885088" size="32" />
			<output>
				<port id="0" precision="I64" names="/blocks.0/attn/Constant_2_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/blocks.0/attn/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/Reshape_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_244" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3885120" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/blocks.0/attn/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/Transpose_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_4606_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="3885152" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_4606" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/blocks.0/attn/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/Mul_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_4266_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 512" offset="3885154" size="524288" />
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_4266" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/blocks.0/attn/key/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/key/MatMul_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/blocks.0/attn/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3885088" size="32" />
			<output>
				<port id="0" precision="I64" names="/blocks.0/attn/Constant_3_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/blocks.0/attn/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/Reshape_1_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_254" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4409442" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/blocks.0/attn/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/Transpose_1_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>64</dim>
					<dim>1500</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_4607_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="3885152" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_4607" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/blocks.0/attn/Mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>64</dim>
					<dim>1500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/Mul_1_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>64</dim>
					<dim>1500</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/blocks.0/attn/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>64</dim>
					<dim>1500</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/Cast_output_0,/blocks.0/attn/MatMul_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1500</dim>
					<dim>1500</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/blocks.0/attn/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1500</dim>
					<dim>1500</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/blocks.0/attn/Cast_1_output_0,/blocks.0/attn/Softmax_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1500</dim>
					<dim>1500</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_4608_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="4409474" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_4608" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_4273_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 512" offset="4410498" size="524288" />
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_4273" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/blocks.0/attn/value/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/value/MatMul_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/blocks.0/attn/value/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/value/Add_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/blocks.0/attn/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3885088" size="32" />
			<output>
				<port id="0" precision="I64" names="/blocks.0/attn/Constant_4_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/blocks.0/attn/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/Reshape_2_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_264" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3885120" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/blocks.0/attn/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/Transpose_2_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/blocks.0/attn/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1500</dim>
					<dim>1500</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/MatMul_1_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_271" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3885120" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/blocks.0/attn/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1500</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/Transpose_3_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/blocks.0/attn/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/blocks.0/attn/Shape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/blocks.0/attn/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4934786" size="8" />
			<output>
				<port id="0" precision="I64" names="/blocks.0/attn/Constant_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/blocks.0/attn/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4934794" size="8" />
			<output>
				<port id="0" precision="I64" names="/blocks.0/attn/Constant_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Broadcast_279" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4934802" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/blocks.0/attn/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/blocks.0/attn/Slice_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/blocks.0/attn/Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3358744" size="8" />
			<output>
				<port id="0" precision="I64" names="/blocks.0/attn/Constant_8_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/blocks.0/attn/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/blocks.0/attn/Concat_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/blocks.0/attn/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/Reshape_3_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_4280_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 512" offset="4934810" size="524288" />
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_4280" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/blocks.0/attn/out/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/out/MatMul_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/blocks.0/attn/out/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/out/Add_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/blocks.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/Add_output_0,/blocks.0/mlp_ln/Cast_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_4613_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="5459098" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_4613" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_4612_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 2048" offset="5460122" size="4096" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_4612" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_335" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3358744" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/blocks.0/mlp_ln/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/mlp_ln/Div_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_4610_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="5464218" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_4610" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/blocks.0/mlp_ln/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/mlp_ln/Mul_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_4611_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="5465242" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_4611" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/blocks.0/mlp_ln/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/mlp_ln/Add_1_output_0,/blocks.0/mlp_ln/Cast_1_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_4288_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2048, 512" offset="5466266" size="2097152" />
			<output>
				<port id="0" precision="FP16">
					<dim>2048</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_4288" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2048</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2048</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/blocks.0/mlp/mlp.0/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2048</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/mlp/mlp.0/MatMul_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/blocks.0/mlp/mlp.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/mlp/mlp.0/Add_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/blocks.0/mlp/mlp.1/Mul_1" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/blocks.0/mlp/mlp.1/Mul_1_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_4296_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 2048" offset="7563418" size="2097152" />
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_4296" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/blocks.0/mlp/mlp.2/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>2048</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/mlp/mlp.2/MatMul_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="/blocks.0/mlp/mlp.2/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/mlp/mlp.2/Add_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/blocks.0/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/Add_1_output_0,/blocks.1/attn_ln/Cast_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_4620_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="9660570" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_4620" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_4616_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="9661594" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_4616" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Constant_363" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3358744" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/blocks.1/attn_ln/Div" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/attn_ln/Div_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_4614_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="9662618" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_4614" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="/blocks.1/attn_ln/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/attn_ln/Mul_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_4615_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="9663642" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_4615" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="/blocks.1/attn_ln/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/attn_ln/Add_1_output_0,/blocks.1/attn_ln/Cast_1_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_4304_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 512" offset="9664666" size="524288" />
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Constant_4304" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="/blocks.1/attn/query/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/attn/query/MatMul_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="/blocks.1/attn/query/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/attn/query/Add_output_0">
					<dim>1</dim>
					<dim>1500</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="/blocks.1/attn/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3885088" size="32" />
			<output>
				<port id="0" precision="I64" names="/blocks.1/attn/Constant_2_output_0">
					<dim>4</dim>
